tutorials/of13/DTCHullWave/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.water 0;
}

zones
{
    cells
    {
        type        box;

        box         (-999 -999 -999) (999 999 0.244);

        values
        {
            alpha.water 1;
        }
    }
}

extrapolatePatches
{
    "inlet|outlet"   (alpha.water);
}

// ************************************************************************* //
